tutorial/NACA0012/NACA00122D_4deg_v230/0/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    front
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    back
    {
        type            empty;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }       

    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            zeroGradient;
    }

}




// ************************************************************************* //
