tutorial/NACA0012/NACA00122D_4deg_v230/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
