tutorial/NACA0012/NACA00122D_4deg_v230/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          200;
        startFace       31760;
    }
    outlet
    {
        type            patch;
        inGroups        1(freestream);
        nFaces          160;
        startFace       31960;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       32120;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16000;
        startFace       48120;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          120;
        startFace       64120;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
120
(
(5.551115123e-17 -1.387778781e-17 -1.387778781e-17)
(-5.551115123e-17 1.387778781e-17 -0)
(-8.326672685e-17 6.938893904e-18 -0)
(-2.775557562e-17 1.387778781e-17 -0)
(-2.775557562e-17 6.938893904e-18 1.387778781e-17)
(-0 -6.938893904e-18 1.387778781e-17)
(-5.551115123e-17 6.938893904e-18 1.387778781e-17)
(-0 6.938893904e-18 -0)
...
)
;
    }
)

// ************************************************************************* //
